In [3]:
import pandas as pd

In [4]:
type(pd)

module

In [ ]:
type

In [5]:
df= pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df.head(3)                           ### returns the first n rows

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

In [15]:
df.tail(2)

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [16]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [14]:
### get information on unique values
df['col2'].unique()                   ### gives me unique values in col2

array([444, 555, 666], dtype=int64)

In [17]:
### to get just the number of unique values in a column
df['col2'].nunique()

### other way
### len(df['col2'].unique())

3

In [19]:
df['col2'].value_counts()        ### gives the number of counts each value was occuring = frequency table in r

444    2
555    1
666    1
Name: col2, dtype: int64

In [18]:
### selecting data from dataframe using criteria from column

newdf= df[df['col1']>2]
newdf

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [20]:
### selecting data from dataframe using criteria from multiple columns
#### please note that we need to use & for AND and | for or
newdf= df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [18]:


(df['col1']>2) & (df['col2']==444)

0    False
1    False
2    False
3     True
dtype: bool

In [17]:
newdf1 = df[(df['col1']>2) & (df['col2']==444)]
newdf1

   col1  col2 col3
3     4   444  xyz

APPLY FUNCTIONS

In [24]:
###applying functions
#### Allows to apply custom or user functions on a given data frame column 
def twice(x):
    return x*2

In [25]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [26]:
df['col1'].apply(twice)        ### will multiply all elements in col1 by 2

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [26]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [27]:
### gives the length of all values in col 3

df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [28]:
###using lambra expressions where the function is directly called
#### multiples each value in col2 by 2
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [22]:
#### soft drop columns...axis=1 should be given to represent columns
#### to hard drop columns, we can use inplace=True
df.drop('col2',axis=1)

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [30]:
###permanently removing columns
### del df['col1']

In [31]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [29]:
### gives you the column and index names
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [30]:
### range of index
df.index

RangeIndex(start=0, stop=4, step=1)

In [32]:
### sorting a dataframe
#### keep inplace as False by default
#### note index sticks to rows
df.sort_values(by='col2',inplace=False)

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [34]:
df.sort_values(by='col3')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [35]:
##check for null
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [36]:
###drop rows in NaN values
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [37]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### USING PIVOT TABLES

In [38]:
###filling NaN values with another valid value
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [40]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [41]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [43]:
#### 3 main arguments, values, index and columns
### we want values to represent column D
### index is 'A' col and 'B' col
#### we want the columns to be specified by 'C'
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN